//Урок #2
//Переменные, типы данных

//Задание #1:
//1. Объяви переменные с следующими типами данных:
//Имя (тип данных: String)
//Возраст (тип данных: int)
//Любимое число (тип данных: double)
//Любимый символ (тип данных: char)
//Ответ на вопрос "Ты любишь программировать?" (тип данных: boolean)
//2. Присвой им значения по своему усмотрению.
//3. Выведи на экран все значения переменных в таком формате:
//Имя: [значение переменной]
//Возраст: [значение переменной]
//Любимое число: [значение переменной]
//Любимый символ: [значение переменной]
//Любит программировать: [значение переменной]

public class Main
{
    public static void main(String[] args)
    {
        System.out.println(new ConsoleCreator().getInstance());
    }
}